#!/usr/bin/env python
#-*- coding:utf-8 -*-
#@time:  2019/10/7 17:04
#@author:wangtongpei

# 2，用列表推导式做下列小题
# (4)	求出50以内能被3整除的数的平方，并放入到一个列表中。
li1 = [i**2 for i in range(50) if i%3==0]  #写法1
li42 = [i*i for i in range(50) if i%3==0]  #写法2
print(li1)  #[0, 9, 36, 81, 144, 225, 324, 441, 576, 729, 900, 1089, 1296, 1521, 1764, 2025, 2304]
print(li42) #[0, 9, 36, 81, 144, 225, 324, 441, 576, 729, 900, 1089, 1296, 1521, 1764, 2025, 2304]
print('----------------------1')

# (5)	构建一个列表：['python1期', 'python2期', 'python3期', 'python4期',
# 'python6期', 'python7期', 'python8期', 'python9期', 'python10期']
li2 = ['python %s 期' % i for i in range(1,11)]  #题目没有看清除，需要去掉5--读题不仔细（
#知识点：占位符 %s
# 自己会做的但是最后丢分的--wujun）
#小结，再简单的题，读题必须要只字不差（解决办法：每个题目只字不差读2次）
print(li2)

li52 = ['python %s 期' % i for i in range(1,11) if i != 5]
print(li52)  #['python 1 期', 'python 2 期', 'python 3 期', 'python 4 期',
# 'python 6 期', 'python 7 期', 'python 8 期', 'python 9 期', 'python 10 期']
print('----------------------2')

# (6)	构建一个列表：[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5), (5, 6)]
#方法1
li1 = [0,1,2,3,4,5]
li2 = [1,2,3,4,5,6]
li3 = [(i,j) for i in range(6) for j in range(1,7) if j == i+1]
print(li3)  #[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5), (5, 6)]

#方法2 老师思路  推荐 更简洁（对比两个思路）
# li1 = [0,1,2,3,4,5]
# li2 = [1,2,3,4,5,6]
li62 = [(i,i+1) for i in range(6)]
print(li62)  #[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5), (5, 6)]
print('----------------------3')











