#!/usr/bin/env python
#-*- coding:utf-8 -*-
#@time:  2019/10/7 16:55
#@author:wangtongpei

# 2，用列表推导式做下列小题
# (1)	过滤掉长度小于3的字符串列表，并将剩下的转换成大写字母
li1 = ['jack','tom','bob','an']
li2 = [i.upper() for i in li1 if len(i)>=3]
print(li2)  #['JACK', 'TOM', 'BOB']
print('---------------1')

# (2)	求(x,y)其中x是0-5之间的偶数，y是0-5之间的奇数组成的元组列表
#方法1
li3 = [(x,y) for x in range(6) if x%2==0 for y in range(6) if y%2==1]
print(li3) #[(0, 1), (0, 3), (0, 5), (2, 1), (2, 3), (2, 5), (4, 1), (4, 3), (4, 5)]
#关键点：读懂题目，知道最后正确答案的形式是列表中包含元组，元组的元素1是偶数，元素2是奇数
#题目没看明白的解决办法：反复读几遍，放慢速度读

#方法2
li22 = [(x,y) for x in range(5) for y in range(6) if x%2==0 if y%2==1]
li23 = [(x,y) for x in range(5) for y in range(6) if x%2==0 and y%2==1]
print(li22)
print(li23)
print('---------------2')

# (3)	求M中3,6,9组成的列表M = [[1,2,3],[4,5,6],[7,8,9]]
#方法1  从[[1,2,3],[4,5,6],[7,8,9]]  得到[3,6,9]
M = [[1,2,3],[4,5,6],[7,8,9]]
li4 = [i[-1] for i in M ]
print(li4)  #[3, 6, 9]
print('---------------3')

#方法2  从[3,6,9] 得到 [[1,2,3],[4,5,6],[7,8,9]]
li1 = [3,6,9]
li32 = [[i-2,i-1,i] for i in li1]  #直接遍历列表即可（不需要索引号取值）
print(li32)  #[[1, 2, 3], [4, 5, 6], [7, 8, 9]]
#关键点：找出规律
print('---------------3-2')














