#!/usr/bin/env python
#-*- coding:utf-8 -*-

# 2. 电影投票. 程序先给出⼀个⽬前正在上映的电影列表. 由⽤户给每⼀个电影投票. 最终 将该⽤户投票信息公布出来
lst = ['⾦瓶梅', '解救吾先⽣', '美国往事', '⻄⻄⾥的美丽传说']   #pdf的字体copy可能有问题
# 结果: {'⾦瓶梅': 99, '解救吴先⽣': 80, '美国往事': 6, '⻄⻄⾥的美丽传说': 23}

"""
思路：
1、投票是递增的过程  +=1
"""

li1 = ["金瓶梅","解救吾先生","美国往事","西西里的魅力传说"]

#方法2 空字典
li1 = ["金瓶梅","解救吾先生","美国往事","西西里的魅力传说"]
dic1 = {}
count =0
while 1:
    content = input("请输入您最喜欢的电影名字，输入q退出投票：")  #输入的是字符串
    if content.upper() == "Q":
        break
    elif content in li1:
        if content not in dic1:
            dic1[content] = 1    #如果不在字典中，初始值给1
        else:  #如果在字典中，value自增1（可以是1-写死了，也可以是dic1[content]-写活了# ）
            dic1[content] += 1
    else:
        print("您输入的电影还没有上映，请重新输入正在上映的电影")
print(dic1)













