#!/usr/bin/env python
#-*- coding:utf-8 -*-

# 3, 写代码完成99乘法表.(升级题)
# 1 * 1 = 1
# 2 * 1 = 2 2 * 2 = 4
# 3 * 1 = 3 3 * 2 = 6 3 * 3 = 9
# ......
# 8 * 1 = 8 8 * 2 = 16 8 * 3 = 24 8 * 4 = 32 8 * 5 = 40 8 * 6 = 48 8 * 7 = 56 8 * 8 = 64
# 9 * 1 = 9 9 * 2 = 18 9 * 3 = 27 9 * 4 = 36 9 * 5 = 45 9 * 6 = 54 9 * 7 = 63 9 * 8 = 72 9 * 9 = 81

for i in range(1,10):
    # print(i)  #1 先打印9行  默认换行
    for j in range(1,i+1):  #注意点：拼写range不能缺少   第2行（从1数到2） 第3行（从1数到3）
        print('%s * %s = %s' % (i,j,i*j),end=' ')  #去掉换行
    print()  #换行
'''
i=1 i+1=2 j=1
i=2 i+1=3 j=1 j=2
i=3 i+1=4 j=1 j=2 j=3

'''
print('-------------------1')











