#!/usr/bin/env python
#-*- coding:utf-8 -*-

# 4.
# 税务部门征收所得税.规定如下:
# 1).收入在2000以下的.免征.
# 2).收入在2000 - 4000
# 的, 超过2000部分要征收3 % 的税.
# 3).收入在4000 - 6000
# 的, 超过4000部分要征收5 % 的税.
# 4).收入在6000 - 10000
# 的, 超过6000部分要征收8 % 的税.
# 4).收入在10000以上的, 超过部分征收20 % 的税.
# 注, 如果一个人的收入是8000, 那么他要交2000到4000的税加上4000到6000的税加上6000到8000的税.
#    收入 = 8000 - (4000 - 2000) * 3 % -(6000 - 4000) * 4 % -(8000 - 6000) * 8 %
#         让用户输入它的工资, 计算最终用户拿到手是多少钱.

salary = 3000
if salary<2000:
    print("不用交税了")
    print("你的税前收入是%s，个税是%s,税后收入是%s" % (salary, 0,(salary-0)))
elif salary<4000:
    tax = (salary-2000) * 3/100  #注意点1：百分号不能这么写3%，因为%表示取余数 用3/100或者0.03表示百分之三
    # print("你的税前收入是%s，个税是%s,税后收入是%s" % (salary,tax,(salary-tax)))
    # print("你的税前收入是%s，个税是%.2f,税后收入是%s" % (salary,tax,(salary-tax)))
    #保留小数点后2位
    print("你的税前收入是%s，个税是%.0f,税后收入是%s" % (salary,tax,(salary-tax)))
    # 保留小数点后0位
elif salary<6000:
    tax = 2000 * 3/100 + (salary-4000) * 5/100
    print("你的税前收入是%s，个税是%s,税后收入是%s" % (salary, tax,(salary-tax)))
elif salary<10000:
    tax = 2000 * 3/100 + 4000 * 5/100 + (salary-6000) * 8/100
    print("你的税前收入是%s，个税是%s,税后收入是%s" % (salary, tax,(salary-tax)))
else:
    tax = 2000 * 3 / 100 + 4000 * 5 / 100 +  6000 * 8 / 100 + (salary-10000) * 20/100
    print("你的税前收入是%s，个税是%s,税后收入是%s" % (salary, tax,(salary-tax)))













