#!/usr/bin/env python
#-*- coding:utf-8 -*-

# 4. 税务部门征收所得税.规定如下:
# 1).收入在2000以下的.免征.
# 2).收入在2000 - 4000
# 的, 超过2000部分要征收3 % 的税.
# 3).收入在4000 - 6000
# 的, 超过4000部分要征收5 % 的税.
# 4).收入在6000 - 10000
# 的, 超过6000部分要征收8 % 的税.
# 4).收入在10000以上的, 超过部分征收20 % 的税.
# 注, 如果一个人的收入是8000, 那么他要交2000到4000的税加上4000到6000的税加上6000到8000的税.
#    收入 = 8000 - (4000 - 2000) * 3 % -(6000 - 4000) * 4 % -(8000 - 6000) * 8 %
#         让用户输入它的工资, 计算最终用户拿到手是多少钱.

# 这个题目逻辑相对比较简单，主要是记流水账

while 1:
    salary = input("请输入您的税前收入，输入q退出:")  #输入的是字符串，需要转换成数字才能计算
    if salary.isdigit():  #判断输入的字符串是否是数字形式的
        salary = int(salary)  #注意是int，而不是input  注意拼写
        if salary < 2000:
            tax = 0
        elif  salary < 4000:
            tax = (salary-2000) * 0.03
            # tax = salary * 3/100
            # tax = salary * (3%)   #这里百分数不能直接写3%，因为python中%表示是取模-取余，
            # 所以要么是*3/100 ，要么是0.03  注意点   关键点1
        elif  salary < 6000:
            tax = 2000*0.03 + (salary-4000)*0.05
        elif  salary < 10000:
            tax = 2000 * 0.03 + 4000 * 0.05 + (salary-6000)*0.08
        elif salary >= 10000:
            tax = 2000 * 0.03 + 4000 * 0.05 + 6000* 0.08 + (salary-10000)*0.2
        print("您的税是%s" % (tax))
        print("您的税后收入是%s" % (salary-tax))
    elif salary.upper() == "Q":
        break
    else:
        print("您的输入不合法，请输入数字")















